wrkProfiler/wrk/wrk-stage-2.txt
++put++


wrk -t4 -c4 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8086
Running 1m test @ http://localhost:8086
  4 threads and 4 connections
  Thread calibration: mean lat.: 0.887ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.868ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.851ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.856ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.89ms  314.88us   7.76ms   62.45%
    Req/Sec   263.93     50.51   500.00     64.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.89ms
 75.000%    1.14ms
 90.000%    1.30ms
 99.000%    1.50ms
 99.900%    1.92ms
 99.990%    2.92ms
 99.999%    7.76ms
100.000%    7.76ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.179     0.000000            1         1.00
       0.476     0.100000         5019         1.11
       0.585     0.200000        10038         1.25
       0.687     0.300000        15040         1.43
       0.784     0.400000        20015         1.67
       0.887     0.500000        25001         2.00
       0.938     0.550000        27530         2.22
       0.989     0.600000        30018         2.50
       1.041     0.650000        32525         2.86
       1.090     0.700000        34998         3.33
       1.140     0.750000        37504         4.00
       1.166     0.775000        38794         4.44
       1.191     0.800000        40042         5.00
       1.216     0.825000        41293         5.71
       1.242     0.850000        42513         6.67
       1.271     0.875000        43755         8.00
       1.288     0.887500        44398         8.89
       1.304     0.900000        45020        10.00
       1.322     0.912500        45666        11.43
       1.339     0.925000        46253        13.33
       1.358     0.937500        46883        16.00
       1.369     0.943750        47197        17.78
       1.381     0.950000        47512        20.00
       1.392     0.956250        47810        22.86
       1.404     0.962500        48123        26.67
       1.419     0.968750        48445        32.00
       1.426     0.971875        48593        35.56
       1.435     0.975000        48755        40.00
       1.443     0.978125        48921        45.71
       1.453     0.981250        49075        53.33
       1.466     0.984375        49219        64.00
       1.473     0.985938        49295        71.11
       1.482     0.987500        49376        80.00
       1.492     0.989062        49452        91.43
       1.505     0.990625        49537       106.67
       1.517     0.992188        49609       128.00
       1.523     0.992969        49645       142.22
       1.535     0.993750        49686       160.00
       1.546     0.994531        49726       182.86
       1.556     0.995313        49762       213.33
       1.574     0.996094        49804       256.00
       1.580     0.996484        49821       284.44
       1.594     0.996875        49840       320.00
       1.619     0.997266        49862       365.71
       1.644     0.997656        49879       426.67
       1.697     0.998047        49899       512.00
       1.750     0.998242        49909       568.89
       1.798     0.998437        49918       640.00
       1.850     0.998633        49928       731.43
       1.888     0.998828        49940       853.33
       1.963     0.999023        49948      1024.00
       2.014     0.999121        49954      1137.78
       2.027     0.999219        49957      1280.00
       2.059     0.999316        49962      1462.86
       2.085     0.999414        49968      1706.67
       2.163     0.999512        49972      2048.00
       2.203     0.999561        49976      2275.56
       2.223     0.999609        49977      2560.00
       2.279     0.999658        49979      2925.71
       2.315     0.999707        49982      3413.33
       2.355     0.999756        49984      4096.00
       2.477     0.999780        49986      4551.11
       2.501     0.999805        49987      5120.00
       2.541     0.999829        49988      5851.43
       2.565     0.999854        49989      6826.67
       2.607     0.999878        49990      8192.00
       2.917     0.999890        49991      9102.22
       2.921     0.999902        49992     10240.00
       2.921     0.999915        49992     11702.86
       3.429     0.999927        49993     13653.33
       3.429     0.999939        49993     16384.00
       4.555     0.999945        49994     18204.44
       4.555     0.999951        49994     20480.00
       4.555     0.999957        49994     23405.71
       6.155     0.999963        49995     27306.67
       6.155     0.999969        49995     32768.00
       6.155     0.999973        49995     36408.89
       6.155     0.999976        49995     40960.00
       6.155     0.999979        49995     46811.43
       7.759     0.999982        49996     54613.33
       7.759     1.000000        49996          inf
#[Mean    =        0.890, StdDeviation   =        0.315]
#[Max     =        7.756, Total count    =        49996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60004 requests in 1.00m, 3.83MB read
Requests/sec:   1000.05
Transfer/sec:     65.43KB

wrk -t4 -c4 -d120s -R10000 -s ./wrk/put.lua --latency http://localhost:8086
Running 2m test @ http://localhost:8086
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.110ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.116ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.106ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.108ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.17ms    1.25ms  36.90ms   98.78%
    Req/Sec     2.64k   301.62     9.33k    82.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.51ms
 90.000%    1.83ms
 99.000%    2.78ms
 99.900%   22.33ms
 99.990%   33.69ms
 99.999%   36.13ms
100.000%   36.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.050     0.000000            2         1.00
       0.352     0.100000       110345         1.11
       0.583     0.200000       220078         1.25
       0.803     0.300000       330098         1.43
       0.964     0.400000       440499         1.67
       1.081     0.500000       550083         2.00
       1.140     0.550000       605283         2.22
       1.205     0.600000       660404         2.50
       1.296     0.650000       715011         2.86
       1.402     0.700000       770000         3.33
       1.508     0.750000       825103         4.00
       1.562     0.775000       852574         4.44
       1.615     0.800000       879991         5.00
       1.668     0.825000       907507         5.71
       1.722     0.850000       935302         6.67
       1.773     0.875000       962507         8.00
       1.800     0.887500       976699         8.89
       1.827     0.900000       990384        10.00
       1.854     0.912500      1003960        11.43
       1.882     0.925000      1017467        13.33
       1.913     0.937500      1031243        16.00
       1.930     0.943750      1038519        17.78
       1.947     0.950000      1045086        20.00
       1.966     0.956250      1052040        22.86
       1.987     0.962500      1058926        26.67
       2.010     0.968750      1065735        32.00
       2.024     0.971875      1069203        35.56
       2.040     0.975000      1072539        40.00
       2.059     0.978125      1075918        45.71
       2.087     0.981250      1079325        53.33
       2.141     0.984375      1082749        64.00
       2.207     0.985938      1084478        71.11
       2.373     0.987500      1086195        80.00
       2.611     0.989062      1087916        91.43
       2.919     0.990625      1089625       106.67
       3.379     0.992188      1091346       128.00
       3.709     0.992969      1092209       142.22
       4.175     0.993750      1093066       160.00
       4.919     0.994531      1093925       182.86
       6.039     0.995313      1094781       213.33
       7.651     0.996094      1095639       256.00
       8.831     0.996484      1096071       284.44
      10.151     0.996875      1096499       320.00
      11.671     0.997266      1096929       365.71
      13.583     0.997656      1097358       426.67
      15.783     0.998047      1097787       512.00
      17.071     0.998242      1098006       568.89
      18.271     0.998437      1098217       640.00
      19.599     0.998633      1098432       731.43
      21.039     0.998828      1098648       853.33
      22.543     0.999023      1098865      1024.00
      23.263     0.999121      1098970      1137.78
      23.999     0.999219      1099077      1280.00
      24.799     0.999316      1099185      1462.86
      25.503     0.999414      1099292      1706.67
      26.463     0.999512      1099400      2048.00
      27.135     0.999561      1099452      2275.56
      27.695     0.999609      1099506      2560.00
      28.383     0.999658      1099561      2925.71
      29.071     0.999707      1099613      3413.33
      29.999     0.999756      1099667      4096.00
      30.591     0.999780      1099695      4551.11
      31.071     0.999805      1099722      5120.00
      31.503     0.999829      1099750      5851.43
      32.111     0.999854      1099774      6826.67
      32.863     0.999878      1099803      8192.00
      33.311     0.999890      1099815      9102.22
      33.727     0.999902      1099828     10240.00
      34.111     0.999915      1099843     11702.86
      34.463     0.999927      1099856     13653.33
      34.783     0.999939      1099869     16384.00
      34.879     0.999945      1099875     18204.44
      35.071     0.999951      1099883     20480.00
      35.167     0.999957      1099889     23405.71
      35.359     0.999963      1099895     27306.67
      35.551     0.999969      1099902     32768.00
      35.615     0.999973      1099905     36408.89
      35.711     0.999976      1099909     40960.00
      35.807     0.999979      1099912     46811.43
      35.871     0.999982      1099915     54613.33
      35.967     0.999985      1099919     65536.00
      35.999     0.999986      1099921     72817.78
      36.031     0.999988      1099922     81920.00
      36.127     0.999989      1099925     93622.86
      36.127     0.999991      1099925    109226.67
      36.223     0.999992      1099928    131072.00
      36.223     0.999993      1099928    145635.56
      36.351     0.999994      1099929    163840.00
      36.415     0.999995      1099930    187245.71
      36.415     0.999995      1099930    218453.33
      36.479     0.999996      1099931    262144.00
      36.543     0.999997      1099932    291271.11
      36.543     0.999997      1099932    327680.00
      36.671     0.999997      1099933    374491.43
      36.671     0.999998      1099933    436906.67
      36.671     0.999998      1099933    524288.00
      36.767     0.999998      1099934    582542.22
      36.767     0.999998      1099934    655360.00
      36.767     0.999999      1099934    748982.86
      36.767     0.999999      1099934    873813.33
      36.767     0.999999      1099934   1048576.00
      36.927     0.999999      1099935   1165084.44
      36.927     1.000000      1099935          inf
#[Mean    =        1.167, StdDeviation   =        1.245]
#[Max     =       36.896, Total count    =      1099935]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199976 requests in 2.00m, 76.67MB read
Requests/sec:   9999.91
Transfer/sec:    654.29KB

++ get ++


wrk -t4 -c4 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8086
Running 1m test @ http://localhost:8086
  4 threads and 4 connections
  Thread calibration: mean lat.: 0.943ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.949ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.922ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.926ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.91ms  386.32us  20.50ms   75.59%
    Req/Sec   262.37     48.84   777.00     71.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.91ms
 75.000%    1.16ms
 90.000%    1.32ms
 99.000%    1.54ms
 99.900%    2.32ms
 99.990%   14.23ms
 99.999%   20.51ms
100.000%   20.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.167     0.000000            1         1.00
       0.492     0.100000         5020         1.11
       0.598     0.200000        10028         1.25
       0.700     0.300000        15012         1.43
       0.808     0.400000        20036         1.67
       0.909     0.500000        25011         2.00
       0.960     0.550000        27535         2.22
       1.010     0.600000        30011         2.50
       1.061     0.650000        32525         2.86
       1.111     0.700000        35001         3.33
       1.160     0.750000        37496         4.00
       1.187     0.775000        38786         4.44
       1.213     0.800000        40035         5.00
       1.239     0.825000        41288         5.71
       1.265     0.850000        42528         6.67
       1.289     0.875000        43751         8.00
       1.302     0.887500        44389         8.89
       1.315     0.900000        45005        10.00
       1.330     0.912500        45618        11.43
       1.352     0.925000        46271        13.33
       1.372     0.937500        46882        16.00
       1.383     0.943750        47201        17.78
       1.395     0.950000        47524        20.00
       1.405     0.956250        47825        22.86
       1.416     0.962500        48135        26.67
       1.433     0.968750        48436        32.00
       1.442     0.971875        48593        35.56
       1.454     0.975000        48748        40.00
       1.467     0.978125        48905        45.71
       1.481     0.981250        49059        53.33
       1.496     0.984375        49216        64.00
       1.506     0.985938        49289        71.11
       1.518     0.987500        49369        80.00
       1.531     0.989062        49448        91.43
       1.544     0.990625        49524       106.67
       1.560     0.992188        49607       128.00
       1.567     0.992969        49642       142.22
       1.578     0.993750        49683       160.00
       1.589     0.994531        49720       182.86
       1.607     0.995313        49761       213.33
       1.635     0.996094        49797       256.00
       1.657     0.996484        49817       284.44
       1.687     0.996875        49836       320.00
       1.736     0.997266        49856       365.71
       1.778     0.997656        49875       426.67
       1.880     0.998047        49895       512.00
       1.966     0.998242        49905       568.89
       2.053     0.998437        49915       640.00
       2.117     0.998633        49924       731.43
       2.253     0.998828        49934       853.33
       2.375     0.999023        49944      1024.00
       2.455     0.999121        49949      1137.78
       2.491     0.999219        49953      1280.00
       2.611     0.999316        49958      1462.86
       2.753     0.999414        49963      1706.67
       2.955     0.999512        49968      2048.00
       3.105     0.999561        49971      2275.56
       3.235     0.999609        49973      2560.00
       4.655     0.999658        49975      2925.71
       6.223     0.999707        49978      3413.33
       9.215     0.999756        49980      4096.00
      10.055     0.999780        49982      4551.11
      10.487     0.999805        49983      5120.00
      12.991     0.999829        49984      5851.43
      13.255     0.999854        49985      6826.67
      13.799     0.999878        49986      8192.00
      14.231     0.999890        49987      9102.22
      16.767     0.999902        49988     10240.00
      16.767     0.999915        49988     11702.86
      17.007     0.999927        49989     13653.33
      17.007     0.999939        49989     16384.00
      17.519     0.999945        49990     18204.44
      17.519     0.999951        49990     20480.00
      17.519     0.999957        49990     23405.71
      18.015     0.999963        49991     27306.67
      18.015     0.999969        49991     32768.00
      18.015     0.999973        49991     36408.89
      18.015     0.999976        49991     40960.00
      18.015     0.999979        49991     46811.43
      20.511     0.999982        49992     54613.33
      20.511     1.000000        49992          inf
#[Mean    =        0.913, StdDeviation   =        0.386]
#[Max     =       20.496, Total count    =        49992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60004 requests in 1.00m, 4.75MB read
  Non-2xx or 3xx responses: 60004
Requests/sec:   1000.04
Transfer/sec:     81.06KB


wrk -t4 -c4 -d120s -R10000 -s ./wrk/get.lua --latency http://localhost:8086
Running 2m test @ http://localhost:8086
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.104ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.103ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.109ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.110ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  724.23us  30.86ms   78.90%
    Req/Sec     2.64k   264.71     8.44k    81.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.09ms
 75.000%    1.51ms
 90.000%    1.83ms
 99.000%    2.73ms
 99.900%    9.21ms
 99.990%   16.28ms
 99.999%   28.53ms
100.000%   30.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.047     0.000000            1         1.00
       0.357     0.100000       110376         1.11
       0.586     0.200000       220090         1.25
       0.806     0.300000       330471         1.43
       0.967     0.400000       440401         1.67
       1.085     0.500000       550218         2.00
       1.145     0.550000       605468         2.22
       1.211     0.600000       660568         2.50
       1.300     0.650000       715159         2.86
       1.406     0.700000       769987         3.33
       1.512     0.750000       825092         4.00
       1.567     0.775000       852609         4.44
       1.621     0.800000       880036         5.00
       1.676     0.825000       907858         5.71
       1.729     0.850000       935097         6.67
       1.781     0.875000       962725         8.00
       1.807     0.887500       976380         8.89
       1.834     0.900000       990030        10.00
       1.862     0.912500      1003898        11.43
       1.891     0.925000      1017763        13.33
       1.922     0.937500      1031326        16.00
       1.939     0.943750      1038206        17.78
       1.958     0.950000      1045106        20.00
       1.978     0.956250      1051881        22.86
       2.000     0.962500      1058905        26.67
       2.025     0.968750      1065789        32.00
       2.040     0.971875      1069112        35.56
       2.059     0.975000      1072737        40.00
       2.081     0.978125      1076018        45.71
       2.113     0.981250      1079365        53.33
       2.183     0.984375      1082794        64.00
       2.269     0.985938      1084491        71.11
       2.411     0.987500      1086190        80.00
       2.595     0.989062      1087909        91.43
       2.829     0.990625      1089625       106.67
       3.111     0.992188      1091343       128.00
       3.287     0.992969      1092207       142.22
       3.489     0.993750      1093058       160.00
       3.739     0.994531      1093921       182.86
       4.061     0.995313      1094779       213.33
       4.507     0.996094      1095637       256.00
       4.811     0.996484      1096067       284.44
       5.163     0.996875      1096500       320.00
       5.591     0.997266      1096926       365.71
       6.131     0.997656      1097359       426.67
       6.819     0.998047      1097785       512.00
       7.211     0.998242      1098001       568.89
       7.619     0.998437      1098214       640.00
       8.095     0.998633      1098429       731.43
       8.639     0.998828      1098647       853.33
       9.287     0.999023      1098860      1024.00
       9.655     0.999121      1098967      1137.78
      10.031     0.999219      1099073      1280.00
      10.399     0.999316      1099183      1462.86
      10.799     0.999414      1099289      1706.67
      11.231     0.999512      1099395      2048.00
      11.455     0.999561      1099449      2275.56
      11.743     0.999609      1099504      2560.00
      12.151     0.999658      1099558      2925.71
      12.615     0.999707      1099610      3413.33
      13.135     0.999756      1099664      4096.00
      13.399     0.999780      1099691      4551.11
      13.791     0.999805      1099718      5120.00
      14.287     0.999829      1099746      5851.43
      14.831     0.999854      1099771      6826.67
      15.415     0.999878      1099798      8192.00
      15.775     0.999890      1099813      9102.22
      16.343     0.999902      1099825     10240.00
      17.023     0.999915      1099839     11702.86
      17.935     0.999927      1099852     13653.33
      18.879     0.999939      1099865     16384.00
      19.279     0.999945      1099872     18204.44
      19.679     0.999951      1099879     20480.00
      20.351     0.999957      1099886     23405.71
      21.327     0.999963      1099892     27306.67
      22.959     0.999969      1099899     32768.00
      23.775     0.999973      1099902     36408.89
      24.863     0.999976      1099906     40960.00
      25.423     0.999979      1099909     46811.43
      26.223     0.999982      1099912     54613.33
      27.263     0.999985      1099916     65536.00
      27.519     0.999986      1099917     72817.78
      27.983     0.999988      1099919     81920.00
      28.527     0.999989      1099921     93622.86
      28.719     0.999991      1099922    109226.67
      28.975     0.999992      1099924    131072.00
      29.263     0.999993      1099925    145635.56
      29.551     0.999994      1099926    163840.00
      29.823     0.999995      1099927    187245.71
      29.823     0.999995      1099927    218453.33
      30.063     0.999996      1099928    262144.00
      30.255     0.999997      1099929    291271.11
      30.255     0.999997      1099929    327680.00
      30.463     0.999997      1099930    374491.43
      30.463     0.999998      1099930    436906.67
      30.463     0.999998      1099930    524288.00
      30.687     0.999998      1099931    582542.22
      30.687     0.999998      1099931    655360.00
      30.687     0.999999      1099931    748982.86
      30.687     0.999999      1099931    873813.33
      30.687     0.999999      1099931   1048576.00
      30.879     0.999999      1099932   1165084.44
      30.879     1.000000      1099932          inf
#[Mean    =        1.131, StdDeviation   =        0.724]
#[Max     =       30.864, Total count    =      1099932]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199979 requests in 2.00m, 92.75MB read
  Non-2xx or 3xx responses: 939183
Requests/sec:   9999.95
Transfer/sec:    791.44KB